#include <stdio.h>


// Создать программу которая с помощью цикла выводит таблицу умножения на 5 с 1 по 10

int main() {
	
	int j=5;
	
	for (int i= 1; i < 10; i++)
	{
		printf("%i * %i = %i\n",i,j,i*j);		
	}
	
}
